WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
/****************************************************************************
 * hcom_nx_config_manager.c
 *
 *   Copyright (C) 2021 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

//  The methods and data structures in this file provide access to the
//  configuration of the meadow board.
#include <nuttx/config.h>

#include <arpa/inet.h>
#include <ctype.h>
#include <strings.h>
#include <time.h>
#include <nuttx/semaphore.h>
#include <nuttx/kstring.h>

#include "hcom_nx_common.h"
#include <meadow/hcom_upd_shared.h>
#include <meadow/hcom_nuttx_shared.h>
#include <meadow/meadow_hw_version.h>
#include "../espcp/espcp_coprocessor.h"
#include "../espcp/espcp_message_dispatcher.h"
#include "../espcp/espcp_shared_enums.h"
#include "../espcp/espcp_usrsock.h"
#include "../misc/meadow_logging.h"
#include "stm32_uid.h" // stm32_get_uniqueid()

#include "hcom_nx_common.h"

#include "hcom_nx_config_manager.h"
#include "hcom_nx_config_manager_yaml.h"

/****************************************************************************
 * Uncomment the #define below to turn on debug help macros.
 ****************************************************************************/
// #define USE_MEADOW_DEBUG_HELPERS
#include <meadow/meadow_debug_helpers.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/**
 *  @brief Default entry in the network_interfaces array to be used if no interface
 *         is selected in the config file.
 */
#define MEADOW_DEFAULT_NETWORK_INTERFACE    MEADOW_IFT_ESP32

/**
 * @brief String used for version numbers when the value is not available.
 */
#define UNKNOWN_VERSION_STRING              "Not available"

/****************************************************************************
 * Local type defintions.
 ****************************************************************************/

/****************************************************************************
 * Private Data
 ****************************************************************************/

/**
 *  Local variable to hold a pointer to the configuration.
 */
static meadow_configuration_t *meadow_configuration = NULL;

/**
 *  @brief Array of network interfaces available.
 */
static meadow_network_interface_t network_interfaces[] = 
{
    {
        .interface_type = MEADOW_IFT_ESP32,
        .name = MEADOW_IFT_ESP32_NAME,
        .use_dhcp = 1,
        .ip_address = 0,
        .netmask = 0,
        .gateway = 0,
        .psock_methods = &g_usrsock_sockif_esp32
    },
    {
        .interface_type = MEADOW_IFT_ETHERNET,
        .name = MEADOW_IFT_ETHERNET_NAME,
        .use_dhcp = 1,
        .ip_address = 0,
        .netmask = 0,
        .gateway = 0,
        .psock_methods = NULL
    },
    {
        .interface_type = MEADOW_IFT_CELL,
        .name = MEADOW_IFT_CELL_NAME,
        .use_dhcp = 1,
        .ip_address = 0,
        .netmask = 0,
        .gateway = 0,
        .psock_methods = NULL
    }
};

/**
 *  Mutex to be used by any code that wants access to the configuration.
 */
static sem_t config_lock = { };

/**
 *  Structure to hold the F7MicroV2 pin mappings
 */
struct f7_micro_v2_pin_mapping_s
{
    const char* pin_name;
    int pin_value;
};
typedef struct f7_micro_v2_pin_mapping_s f7_micro_v2_pin_mapping_t;

/**
 *  Define the pin mappings as an array of structures.
 */
const f7_micro_v2_pin_mapping_t f7_micro_v2_pin_mappings[] =
{
    { F7_MICRO_V2_A00_PIN_NAME, F7_MICRO_V2_A00_PIN },
    { F7_MICRO_V2_A01_PIN_NAME, F7_MICRO_V2_A01_PIN },
    { F7_MICRO_V2_A02_PIN_NAME, F7_MICRO_V2_A02_PIN },
    { F7_MICRO_V2_A03_PIN_NAME, F7_MICRO_V2_A03_PIN },
    { F7_MICRO_V2_A04_PIN_NAME, F7_MICRO_V2_A04_PIN },
    { F7_MICRO_V2_A05_PIN_NAME, F7_MICRO_V2_A05_PIN },
    { F7_MICRO_V2_D00_PIN_NAME, F7_MICRO_V2_D00_PIN },
    { F7_MICRO_V2_D01_PIN_NAME, F7_MICRO_V2_D01_PIN },
    { F7_MICRO_V2_D02_PIN_NAME, F7_MICRO_V2_D02_PIN },
    { F7_MICRO_V2_D03_PIN_NAME, F7_MICRO_V2_D03_PIN },
    { F7_MICRO_V2_D04_PIN_NAME, F7_MICRO_V2_D04_PIN },
    { F7_MICRO_V2_D05_PIN_NAME, F7_MICRO_V2_D05_PIN },
    { F7_MICRO_V2_D06_PIN_NAME, F7_MICRO_V2_D06_PIN },
    { F7_MICRO_V2_D07_PIN_NAME, F7_MICRO_V2_D07_PIN },
    { F7_MICRO_V2_D08_PIN_NAME, F7_MICRO_V2_D08_PIN },
    { F7_MICRO_V2_D09_PIN_NAME, F7_MICRO_V2_D09_PIN },
    { F7_MICRO_V2_D10_PIN_NAME, F7_MICRO_V2_D10_PIN },
    { F7_MICRO_V2_D11_PIN_NAME, F7_MICRO_V2_D11_PIN },
    { F7_MICRO_V2_D12_PIN_NAME, F7_MICRO_V2_D12_PIN },
    { F7_MICRO_V2_D13_PIN_NAME, F7_MICRO_V2_D13_PIN },
    { F7_MICRO_V2_D14_PIN_NAME, F7_MICRO_V2_D14_PIN },
    { F7_MICRO_V2_D15_PIN_NAME, F7_MICRO_V2_D15_PIN },
};

/**
 *  Structure to hold the cellular mode mappings
 */
typedef struct
{
    const char* mode_name;
    uint32_t mode_id;
} cell_mode_mapping_t;

/**
 *  Define the cell mode mappings as an array of structures.
 */
const cell_mode_mapping_t cell_mode_mappings[] =
{
    {CELL_CATM1_MODE_NAME, CELL_CATM1_MODE},
    {CELL_NBIOT_MODE_NAME, CELL_NBIOT_MODE},
    {CELL_GSM_MODE_NAME, CELL_GSM_MODE},
    {CELL_UTRAN_MODE_NAME, CELL_UTRAN_MODE},
    {CELL_GSM_W_EGPRS_MODE_NAME, CELL_GSM_W_EGPRS_MODE},
    {CELL_UTRAN_W_HSDPA_MODE_NAME, CELL_UTRAN_W_HSDPA_MODE},
    {CELL_UTRAN_W_HSUPA_MODE_NAME, CELL_UTRAN_W_HSUPA_MODE},
    {CELL_UTRAN_W_HSDPA_HSUPA_MODE_NAME, CELL_UTRAN_W_HSDPA_HSUPA_MODE},
    {CELL_E_UTRAN_MODE_NAME, CELL_E_UTRAN_MODE},
    {CELL_CDMA_MODE_NAME, CELL_CDMA_MODE},
    {NULL, CELL_UNKNOWN_MODE}
};

/**
 *  Structure to hold the cellular module mappings
 */
typedef struct
{
    const char* module_name;
    uint32_t module_id;
} cell_module_mapping_t;

/**
 *  Define the cell module mappings as an array of structures.
 */
static const cell_module_mapping_t cell_module_mappings[] =
{
    {CELL_BG770A_MODULE_NAME, CELL_BG770A_MODULE},
    {CELL_M95_MODULE_NAME, CELL_M95_MODULE},
    {CELL_BG95M3_MODULE_NAME, CELL_BG95M3_MODULE},
    {CELL_EG21GL_MODULE_NAME, CELL_EG21GL_MODULE},
    {NULL, CELL_UNKNOWN_MODULE}
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: hcom_nx_config_populate_cell_module_id
 *
 * Description:
 *  Populate the cell module id according to the cell module name set in
 *  the cell.config.yaml
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_populate_cell_module_id(meadow_configuration_t *config)
{
    if ((config == NULL) || (config->default_cell_settings == NULL) || (config->default_cell_settings->module == NULL))
    {
        syslog(LOG_INFO, "Failed getting cell default settings");
        return;
    }

    // Iterate through the mappings and find a match
    for (size_t i = 0; cell_module_mappings[i].module_name != NULL; ++i)
    {
        if (strcasecmp(config->default_cell_settings->module, cell_module_mappings[i].module_name) == 0)
        {
            config->default_cell_settings->module_id = cell_module_mappings[i].module_id;
            return;
        }
    }

    syslog(LOG_INFO, "Failed populating cell module id");
    config->default_cell_settings->module_id = CELL_UNKNOWN_MODULE;
}

/****************************************************************************
 * Name: hcom_nx_config_populate_cell_network_mode_id
 *
 * Description:
 *  Populate the cell network mode id according to the mode set
 *  in the cell.config.yaml
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_populate_cell_network_mode_id(meadow_configuration_t *config)
{
    if ((config == NULL) || (config->default_cell_settings == NULL) || (config->default_cell_settings->mode == NULL))
    {
        syslog(LOG_INFO, "Failed getting default cell settings");
        return;
    }

    // Iterate through the mappings and find a match
    for (size_t i = 0; cell_mode_mappings[i].mode_name != NULL; ++i)
    {
        if (strcasecmp(config->default_cell_settings->mode, cell_mode_mappings[i].mode_name) == 0)
        {
            config->default_cell_settings->mode_id = cell_mode_mappings[i].mode_id;
            return;
        }
    }

    syslog(LOG_INFO, "Failed populating cell network mode id");
    config->default_cell_settings->mode_id = CELL_UNKNOWN_MODE;
}

/****************************************************************************
 * Name: hcom_nx_config_map_cell_network_mode
 *
 * Description:
 *  Map the cell network mode according to the Mode defined in
 *  the cell.config.yaml, since different modules may use distinct integers 
 *  to reference network modes (e.g., Cat-M1 is 8 for Quectel BG95-M3, 
 *  but 7 for Quectel BG770A).
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_map_cell_network_mode(meadow_configuration_t *config)
{
    if ((config == NULL) || (config->default_cell_settings == NULL))
    {
        syslog(LOG_INFO, "Failed getting default cell settings");
        return;
    }

    uint32_t module = config->default_cell_settings->module_id;
    uint32_t mode = config->default_cell_settings->mode_id;

