WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    switch (module)
    {
    case CELL_BG770A_MODULE:
        switch (mode)
        {
        case CELL_CATM1_MODE:
            strcpy(config->default_cell_settings->mode, "7");
            break;
        case CELL_NBIOT_MODE:
            strcpy(config->default_cell_settings->mode, "9");
            break;
        default:
            syslog(LOG_INFO, "Mode %u not supported on BG770A module", mode);
            strcpy(config->default_cell_settings->mode, "");
            break;
        }
        break;

    case CELL_BG95M3_MODULE:
        switch (mode)
        {
        case CELL_CATM1_MODE:
            strcpy(config->default_cell_settings->mode, "8");
            break;
        case CELL_NBIOT_MODE:
            strcpy(config->default_cell_settings->mode, "9");
            break;
        case CELL_GSM_MODE:
            strcpy(config->default_cell_settings->mode, "0");
            break;
        default:
            syslog(LOG_INFO, "Mode %u not supported on BG95-M3 module", mode);
            strcpy(config->default_cell_settings->mode, "");
            break;
        }
        break;

    case CELL_M95_MODULE:
        switch (mode)
        {
        case CELL_GSM_MODE:
            strcpy(config->default_cell_settings->mode, "0");
            break;
        default:
            syslog(LOG_INFO, "Mode %u not supported on M95 module", mode);
            strcpy(config->default_cell_settings->mode, "");
            break;
        }
        break;

    case CELL_EG21GL_MODULE:
        switch (mode)
        {
        case CELL_GSM_MODE:
            strcpy(config->default_cell_settings->mode, "0");
            break;
        case CELL_UTRAN_MODE:
            strcpy(config->default_cell_settings->mode, "2");
            break;
        case CELL_GSM_W_EGPRS_MODE: // GSM W/EGPRS
            strcpy(config->default_cell_settings->mode, "3");
            break;
        case CELL_UTRAN_W_HSDPA_MODE: // UTRAN W/HSDPA
            strcpy(config->default_cell_settings->mode, "4");
            break;
        case CELL_UTRAN_W_HSUPA_MODE: // UTRAN W/HSUPA
            strcpy(config->default_cell_settings->mode, "5");
            break;
        case CELL_UTRAN_W_HSDPA_HSUPA_MODE: // UTRAN W/HSDPA and HSUPA
            strcpy(config->default_cell_settings->mode, "6");
            break;
        case CELL_E_UTRAN_MODE: // E-UTRAN
            strcpy(config->default_cell_settings->mode, "7");
            break;
        case CELL_CDMA_MODE:
            strcpy(config->default_cell_settings->mode, "100");
            break;
        default:
            syslog(LOG_INFO, "Mode %u not supported on EG21GL module", mode);
            strcpy(config->default_cell_settings->mode, "");
            break;
        }
        break;

    default:
        syslog(LOG_INFO, "Failed to map cell network mode name to the equivalent integer");
        strcpy(config->default_cell_settings->mode, "");
        break;
    }
}

/****************************************************************************
 * Name: hcom_nx_config_get_turn_on_pin
 *
 * Description:
 *  Function to get the turn-on pin value from the pin name using a mapping array.
 *
 * Input Parameters:
 *  pin_name - F7v2 pin name (e.g. D10)
 *
 * Returned Value:
 *  The correspondent MCU pin value associated to the F7v2 pin name.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
uint32_t hcom_nx_config_get_turn_on_pin(const char* pin_name)
{
    for (size_t i = 0; i < sizeof(f7_micro_v2_pin_mappings) / sizeof(f7_micro_v2_pin_mappings[0]); ++i)
    {
        if (strcmp(f7_micro_v2_pin_mappings[i].pin_name, pin_name) == 0)
        {
            return f7_micro_v2_pin_mappings[i].pin_value;
        }
    }
    return -1;
}

/****************************************************************************
 * Name: hcom_nx_config_populate_cell_turn_on_pin
 *
 * Description:
 *  Convert the Meadow device pin name to the correspondent binary value.
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_map_cell_turn_on_pin(meadow_configuration_t *config)
{
    if ((config == NULL) || (config->default_cell_settings == NULL))
    {
        syslog(LOG_INFO, "Failed getting default cell settings");
        return;
    }

    char* turn_on_pin_name = config->default_cell_settings->turn_on_pin_name;

    uint32_t pin_value = hcom_nx_config_get_turn_on_pin(turn_on_pin_name);
    if (pin_value != -1) {
        config->default_cell_settings->turn_on_pin = pin_value;
    }
    else
    {
        syslog(LOG_INFO, "Failed populating cell turn-on pin\n");
        config->default_cell_settings->turn_on_pin = F7_MICRO_V2_D10_PIN;
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: hcom_nx_config_lock
 *
 * Description:
 *  Lock the specified configuration object.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_lock(void)
{
    sem_wait(&config_lock);
}

/****************************************************************************
 * Name: hcom_nx_config_unlock
 *
 * Description:
 *  Unlock the specified configuration object.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_unlock(void)
{
    sem_post(&config_lock);
}

/****************************************************************************
 * Name: hcom_nx_config_get_pointer
 *
 * Description:
 *  Get a pointer to the current configuration.
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *  Pointer to the current configuration object.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
meadow_configuration_t *hcom_nx_config_get_pointer(void)
{
    return meadow_configuration;
}

/****************************************************************************
 * Name: hcom_nx_config_manager_logger
 *
 * Description:
 *  Process log requests from the cyaml library.
 *
 * Input Parameters:
 *  level - Logging level.
 *  context - Context.
 *  format - Format string for the log message.
 *  args - Arguments matching the format starting.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_manager_logger(cyaml_log_t level, void *context, const char *format, va_list args)
{
    if (format != NULL)
    {
        char *buffer = malloc(MEADOW_FILE_LOG_LINE_LENGTH);
        if (buffer != NULL)
        {
            meadow_file_logging_level_t log_level = (level == CYAML_LOG_ERROR) ? mfl_error : mfl_info;
            vsnprintf(buffer, MEADOW_FILE_LOG_LINE_LENGTH - 1, format, args);
            char *log = malloc(MEADOW_FILE_LOG_LINE_LENGTH);
            if (log != NULL)
            {
                snprintf(log, MEADOW_FILE_LOG_LINE_LENGTH - 1, "CONFIG: %s", buffer);
                meadow_logging_write(log_level, log);
                free(log);
            }
            MEADOW_TRACE_INFORMATION(buffer);
            free(buffer);
        }
    }
}

/****************************************************************************
 * Name: hcom_nx_config_is_valid_host_name
 *
 * Description:
 *  Validate the host name against the following rules:
 *  - Host name must be less than HOST_NAME_MAX characters.
 *  - Host name must start with a letter.
 *  - Host name must only contain the following characters: a-z A-Z 0-9 - _
 *
 * Input Parameters:
 *  host_name - The host name to be validated.
 *
 * Returned Value:
 *  1 if the host name is valid, 0 otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_is_valid_host_name(const char *host_name)
{
    bool result = 1;

