WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    if ((host_name != NULL) && (strlen(host_name) <= HOST_NAME_MAX) && (strlen(host_name) > 0) && isalpha(host_name[0]))
    {
        for (const char *ch = host_name; *ch != 0; ch++)
        {
            if (!(isalnum(*ch) || (*ch == '-') || (*ch == '_')))
            {
                result = 0;
                break;
            }
        }
    }
    else
    {
        result = 0;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_long_version_string
 *
 * Description:
 *  Get the version information as a long string.
 *
 * Input Parameters:
 *  config - Version information.
 *
 * Returned Value:
 *  Pointer to a block of kernel memory containing the version string.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static char *hcom_nx_config_get_long_version_string(meadow_version_number_t *version)
{
    char *result = NULL;
    
    if ((version->major != 0) || (version->minor != 0) || (version->revision != 0) || (version->build != 0))
    {
        char *storage = (char *) kmm_zalloc(150);
        if (storage != NULL)
        {
            char *branch_name = (char *) kmm_zalloc(66);  // 64 characters for branch + ':' + terminator.
            if (branch_name != NULL)
            {
                if (version->branch_name == NULL)
                {
                    branch_name[0] = 0;
                }
                else
                {
                    snprintf(branch_name, 66, ":%s", version->branch_name);
                }
                snprintf_chk(storage, 150, "%d.%d.%d.%d built %02d %s 20%02d %02d:%02d:%02d UTC (%08x%s)", 
                    version->major, version->minor, version->revision, version->build, version->day, 
                    version->month_text, version->year, version->hour, version->minute, version->second,
                    version->hash, branch_name);
                result = kmm_strdup(storage);
                kmm_free(branch_name);
            }
            kmm_free(storage);
        }
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_short_version_string
 *
 * Description:
 *  Get the version information as a short string (a.b.c.d).
 *
 * Input Parameters:
 *  config - Version information.
 *
 * Returned Value:
 *  Pointer to a block of kernel memory containing the version string.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static char *hcom_nx_config_get_short_version_string(meadow_version_number_t *version)
{
    char *result = NULL;

    if (version != NULL)
    {
        char version_string[45];    // Long enough for 4294967295.4294967295.4294967295.4294967295
        
        if ((version->major != 0) || (version->minor != 0) || (version->revision != 0) || (version->build != 0))
        {
            snprintf(version_string, 45, "%d.%d.%d.%d", version->major, version->minor, version->revision, version->build);
        }
        result = kmm_strdup(version_string);
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_month_text
 *
 * Description:
 *  Convert the integer month value into the three character month name in
 *  a version structure.
 *
 * Input Parameters:
 *  version - Pointer to a version structure.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The month number is in the range 1 - 12 as returned by the system date
 *  application.
 *
 ****************************************************************************/
static void hcom_nx_config_set_month_text(meadow_version_number_t *version)
{
    struct tm t;
    memset(&t, 0, sizeof(struct tm));
    t.tm_mon = version->month - 1;
    strftime(version->month_text, 4, "%b", &t);
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_value
 *
 * Description:
 *  Set a value on the ESP32.
 *
 *  This method will block until the ESP32 confirms that the value has been
 *  set correctly.
 *
 * Input Parameters:
 *  item - type of item to be set.
 *  value - pointer to the value to be set.
 *  value_size - size of the value.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_value(espcp_configuration_items_t item, uint8_t *value, uint32_t value_size)
{
    espcp_configuration_value_t item_value = { };

    item_value.value = malloc(value_size);
    if (item_value.value == NULL)
    {
        return ERROR;
    }
    memcpy(item_value.value, value, value_size);
    item_value.item = item;
    item_value.value_length = value_size;
    int payload_length = espcp_configuration_value_buffer_size(&item_value);
    uint8_t *payload = malloc(payload_length);
    if (payload == NULL)
    {
        free(item_value.value);
        return(ERROR);
    }
    espcp_encode_configuration_value(&item_value, payload);
    free(item_value.value);
    espcp_message_t *message = espcp_create_message_on_heap(espcp_message_types_header, espcp_esp32_interfaces_system,
                                                            espcp_system_function_set_configuration_item, espcp_status_codes_completed_ok,
                                                            espcp_get_next_message_id(), payload, payload_length);
    if (message == NULL)
    {
        free(payload);
        return(ERROR);
    }

    int result = ERROR;
    if (espcp_queue_message(message, true) == espcp_status_codes_completed_ok)
    {
        if (message->status_code == espcp_status_codes_completed_ok)
        {
            result = OK;
        }
    }
    espcp_delete_message_and_payload(message);
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_integer_value
 *
 * Description:
 *  Set an integer value on the ESP32.
 *
 * Input Parameters:
 *  item - type of item to be set.
 *  value - value to be set.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_integer_value(espcp_configuration_items_t item, uint32_t value)
{
    return(hcom_nx_config_set_esp_value(item, (uint8_t *) &value, 4));
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_boolean_value
 *
 * Description:
 *  Set a boolean value on the ESP32.
 *
 * Input Parameters:
 *  item - type of item to be set.
 *  value - value to be set.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_t item, uint8_t value)
{
    return(hcom_nx_config_set_esp_value(item, (uint8_t *) &value, 1));
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_string_value
 *
 * Description:
 *  Set the a string configuration value on the ESP32.
 *
 * Input Parameters:
 *  item - type of item to be set.
 *  value - value to be set.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_string_value(espcp_configuration_items_t item, const char *value)
{
    int result;

