WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
                memcpy(&addr.sin_addr, &gateway, sizeof(struct in_addr));

                char *gateway_addr = inet_ntoa(addr.sin_addr);

                if (hcom_nx_config_update_dns_file(CONFIG_NETDB_RESOLVCONF_PATH, gateway_addr) < 0)
                {
                    syslog(LOG_ERR, "Failed to add default gateway\n");
                    return; 
                }
                syslog(LOG_INFO, "Successful to add default gateway\n");
                config->default_interface->gateway_changed = true;
            }
        }
    }
}

/****************************************************************************
 * Name: hcom_nx_config_find_interface_by_name
 *
 * Description:
 *  Find the specified interface in the list of registered (possible) interfaces.
 *
 * Input Parameters:
 *  name - Name of the interface to find.
 *
 * Returned Value:
 *  Pointer to the interface requested, NULL if the interface cannot be found.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static meadow_network_interface_t *hcom_nx_config_find_interface_by_name(const char *name)
{
    meadow_network_interface_t *interface = NULL;
    if (name != NULL)
    {
        for (int index = 0; index < sizeof(network_interfaces) / sizeof(meadow_network_interface_t); index++)
        {
            if (strcasecmp(network_interfaces[index].name, name) == 0)
            {
                interface = &network_interfaces[index];
                break;
            }
        }
    }
    return(interface);
}

/****************************************************************************
 * Name: hcom_nx_config_process_interface_section
 *
 * Description:
 *  Process a network interface definition from the meadow.config.yaml file.
 *
 * Input Parameters:
 *  yaml_interface - Pointer to information about a network interface.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static void hcom_nx_config_process_interface_section(yaml_network_interface_t *yaml_interface)
{
    if (yaml_interface != NULL)
    {
        meadow_network_interface_t *interface = hcom_nx_config_find_interface_by_name(yaml_interface->name);
        if (interface != NULL)
        {
            interface->ip_address = hcom_nx_config_parse_ip_address(yaml_interface->ip_address);
            interface->netmask = hcom_nx_config_parse_ip_address(yaml_interface->netmask);
            interface->gateway = hcom_nx_config_parse_ip_address(yaml_interface->gateway);
            interface->use_dhcp = hcom_nx_config_parse_boolean(yaml_interface->use_dhcp, 1);
        }
    }
}

/****************************************************************************
 * Name: hcom_nx_config_process_network_section
 *
 * Description:
 *  Process the network section from the meadow.config.yaml file.
 *
 * Input Parameters:
 *  network_config - Pointer the to yaml_network_t object containing the
 *                   network configuration from the config file.
 *  meadow_configuration - Pointer to the configuration information being
 *                         assembled from the config file.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static void hcom_nx_config_process_network_section(yaml_network_t *network_config, meadow_configuration_t *config)
{
    if (network_config != NULL)
    {
        config->get_network_time_at_startup = hcom_nx_config_parse_boolean(network_config->get_network_time_at_startup, 0);
        if (network_config->ntp_servers_count > 0)
        {
            config->ntp_servers_count = network_config->ntp_servers_count;
            config->ntp_servers = kmm_zalloc(meadow_configuration->ntp_servers_count * sizeof(char *));
            for (int index = 0; index < meadow_configuration->ntp_servers_count; index++)
            {
                config->ntp_servers[index] = kmm_strdup(network_config->ntp_servers[index]);
            }
        }
        else
        {
            hcom_nx_config_setup_default_ntp_servers(meadow_configuration);
        }
        config->ntp_refresh_period_seconds = hcom_nx_config_parse_unsigned_integer(network_config->ntp_refresh_period_seconds, NTP_DEFAULT_REFRESH_PERIOD);
        if (config->ntp_refresh_period_seconds < NTP_MINIMUM_REFRESH_PERIOD)
        {
            config->ntp_refresh_period_seconds = NTP_MINIMUM_REFRESH_PERIOD;
        }
        hcom_nx_config_setup_dns_servers(config, network_config->dns_servers, network_config->dns_servers_count);
        bool create_default_dns_resolver_file = true;
        if (network_config->dns_servers_count > 0)
        {
            for (int index = 0; index < network_config->dns_servers_count; index++)
            {
                if (hcom_nx_config_is_valid_ip_address(network_config->dns_servers[index]))
                {
                    create_default_dns_resolver_file = false;
                    break;
                }
            }
        }
        if (create_default_dns_resolver_file)
        {
            hcom_nx_config_setup_default_dns_servers();
        }
        else
        {
            hcom_nx_config_create_dns_resolver_file(network_config->dns_servers, network_config->dns_servers_count);
        }
        //
        //  Now work out the network interface / adapter details.
        //
        if ((network_config->interfaces != NULL) && (network_config->interfaces_count > 0))
        {
            for (int index = 0; index < network_config->interfaces_count; index++)
            {
                hcom_nx_config_process_interface_section(&network_config->interfaces[index]);
            }
        }
        //
        //  Now work out which adapter should be used.
        //
        config->default_interface = hcom_nx_config_find_interface_by_name(network_config->default_interface);
        if (config->default_interface == NULL)
        {
            config->default_interface = hcom_nx_config_find_interface_by_name(MEADOW_IFT_ESP32_NAME);
        }
        config->default_interface->gateway_changed = false;
    }
    else
    {
        hcom_nx_config_setup_default_ntp_servers(config);
        hcom_nx_config_setup_default_dns_servers();
        config->default_interface = &network_interfaces[MEADOW_DEFAULT_NETWORK_INTERFACE];
    }
}

/****************************************************************************
 * Name: hcom_nx_config_process_meadow_config_file
 *
 * Description:
 *  Read the current configuration from flash and populate the configuration
 *  object.
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *  Pointer to the newly populated configuration object or NULL if there was
 *  a problem.
 *
 * Assumptions/Limitations:
 *  This method is only allowed to be called once to read the configuration
 *  at startup.  Duplicate calls to this method simply return the current
 *  value of the meadow_configuration pointer and take no other action.
 *
 ****************************************************************************/
static meadow_configuration_t *hcom_nx_config_process_meadow_config_file(void)
{
    hcom_nx_config_lock();
    if (meadow_configuration == NULL)
    {
        meadow_configuration = (meadow_configuration_t *) kmm_zalloc(sizeof(meadow_configuration_t));
        if (meadow_configuration != NULL)
        {
        	yaml_configuration_t *configuration;

            cyaml_err_t err = cyaml_load_file(MEADOW_CONFIG_DEFAULT_FILE_NAME, &cyaml_config, &configuration_schema, (void **) &configuration, NULL);
            if ((err != CYAML_OK) || (configuration == NULL))
            {
                if (err != CYAML_OK)
                {
                    meadow_logging_write(mfl_error, "Error processing config file, using default config");
                }
                //
                //  Add any default settings here.
                //
                meadow_configuration->using_default_configuration = 1;
                meadow_configuration->reboot_on_unhandled_exceptions = 1;
                meadow_configuration->initialisation_timeout_seconds = DEFAULT_INITIALISATION_TIMEOUT_SECONDS;
                meadow_configuration->reset_esp32_at_startup = 1;
                meadow_configuration->esp_spi_speed_hz = DEFAULT_STM_ESP_SPI_SPEED;
                meadow_configuration->maximum_retry_count = 3;
                hcom_nx_config_setup_default_dns_servers();                
                hcom_nx_config_setup_default_ntp_servers(meadow_configuration);
                meadow_configuration->ntp_refresh_period_seconds = NTP_DEFAULT_REFRESH_PERIOD;
                meadow_configuration->default_interface = &network_interfaces[MEADOW_DEFAULT_NETWORK_INTERFACE];
            }
            else
            {
                meadow_configuration->using_default_configuration = 0;
                if (configuration->mono_control != NULL)
                {
                    meadow_configuration->mono_options = kmm_strdup(configuration->mono_control->options);
                }
                //
                if (configuration->coprocessor != NULL)
                {
                    uint32_t speed = hcom_nx_config_parse_unsigned_integer(configuration->coprocessor->spi_speed_hz, DEFAULT_STM_ESP_SPI_SPEED);
                    meadow_configuration->esp_spi_speed_hz = (speed < 100000) ? 100000 : speed;
                    meadow_configuration->automatically_reconnect = hcom_nx_config_parse_boolean(configuration->coprocessor->automatically_reconnect, false);
                    meadow_configuration->automatically_start_network = hcom_nx_config_parse_boolean(configuration->coprocessor->automatically_start_network, false);
                    meadow_configuration->maximum_retry_count = hcom_nx_config_parse_unsigned_integer(configuration->coprocessor->maximum_retry_count, 3);
                }
                else
                {
                    meadow_configuration->esp_spi_speed_hz = DEFAULT_STM_ESP_SPI_SPEED;
                }
                hcom_nx_config_process_network_section(configuration->network, meadow_configuration);
                if (configuration->internal_debug != NULL)
                {
                    meadow_configuration->trace_level = hcom_nx_config_parse_unsigned_integer(configuration->internal_debug->trace_level, 0);
                    if (meadow_configuration->trace_level > 4)
                    {
                        meadow_configuration->trace_level = 0;
                    }
                    meadow_configuration->use_uart1_for_trace = (strcmp(configuration->internal_debug->uart1_use, "trace") == 0);
                    meadow_configuration->reset_esp32_at_startup = !hcom_nx_config_parse_boolean(configuration->internal_debug->debugger_attached_to_esp, false);
                }
                else
                {
                    meadow_configuration->reset_esp32_at_startup = 1;
                }
                //
                if (configuration->device != NULL)
                {
                    if (configuration->device->name == NULL)
                    {
                        meadow_configuration->device_name = kmm_strdup(MEADOW_CONFIG_DEFAULT_DEVICE_NAME);
                    }
                    else
                    {
                        meadow_configuration->device_name = kmm_strdup(configuration->device->name);
                    }
                    if (configuration->device->reserved_pins != NULL)
                    {
                        meadow_configuration->reserved_pins = kmm_strdup(configuration->device->reserved_pins);
                    }
                    meadow_configuration->reboot_on_unhandled_exceptions = hcom_nx_config_parse_boolean(configuration->device->reboot_on_unhandled_exceptions, true);
                    meadow_configuration->initialisation_timeout_seconds = hcom_nx_config_parse_unsigned_integer(configuration->device->initialisation_timeout_seconds, DEFAULT_INITIALISATION_TIMEOUT_SECONDS);
                    meadow_configuration->sd_storage_supported = hcom_nx_config_parse_boolean(configuration->device->sd_storage_supported, false)
                                                                 && (meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_CCMV2);
                }

                cyaml_free(&cyaml_config, &configuration_schema, configuration, 0);
                meadow_logging_write(mfl_info, "Config file successfully processed");
            }
        }
    }
    hcom_nx_config_unlock();

#if defined(USE_MEADOW_DEBUG_HELPERS)
    MEADOW_TRACE_INFORMATION("Using %s configuration\n", (meadow_configuration->using_default_configuration == 1) ? "default" : "user");
    MEADOW_TRACE_INFORMATION("Device Information:\n");
    MEADOW_TRACE_INFORMATION("    Device name: %s\n", meadow_configuration->device_name);
    MEADOW_TRACE_INFORMATION("    Reboot on unhandled exception: %d\n", meadow_configuration->reboot_on_unhandled_exceptions);
    MEADOW_TRACE_INFORMATION("    Initialisation timeout: %d seconds\n", meadow_configuration->initialisation_timeout_seconds);
    MEADOW_TRACE_INFORMATION("    SD storage enabled: %d\n", meadow_configuration->sd_storage_supported);
    MEADOW_TRACE_INFORMATION("Mono Control:\n");
    MEADOW_TRACE_INFORMATION("    Options: %s\n", (meadow_configuration->mono_options == NULL) ? "None configured" : meadow_configuration->mono_options);
    MEADOW_TRACE_INFORMATION("Coprocessor:\n");
    MEADOW_TRACE_INFORMATION("    SPI speed: %d Hz\n", meadow_configuration->esp_spi_speed_hz);
    MEADOW_TRACE_INFORMATION("    Automatically start network: %d\n", meadow_configuration->automatically_start_network);
    MEADOW_TRACE_INFORMATION("    Automatically reconnect: %d\n", meadow_configuration->automatically_reconnect);
    MEADOW_TRACE_INFORMATION("    Maximum retry count: %d\n", meadow_configuration->maximum_retry_count);
    char address[INET_ADDRSTRLEN];
    MEADOW_TRACE_INFORMATION("Network:\n");
    MEADOW_TRACE_INFORMATION("    Ethernet:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_IFT_ETHERNET]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_IFT_ETHERNET].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ETHERNET].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ETHERNET].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ETHERNET].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    WiFi:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_IFT_ESP32]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_IFT_ESP32].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ESP32].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ESP32].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ESP32].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    BG770A:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_IFT_CELL]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_IFT_CELL].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_CELL].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_CELL].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_CELL].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    Get network time at startup: %d\n", meadow_configuration->get_network_time_at_startup);
    MEADOW_TRACE_INFORMATION("    NTP refresh period: %d seconds\n", meadow_configuration->ntp_refresh_period_seconds);
    MEADOW_TRACE_INFORMATION("    NTP Servers (%d):\n", meadow_configuration->ntp_servers_count);
    int index = 0;
    for (index = 0; index < meadow_configuration->ntp_servers_count; index++)
    {
        inet_ntop(AF_INET, &meadow_configuration->ntp_servers[index], address, INET_ADDRSTRLEN);
        MEADOW_TRACE_INFORMATION("        - %s\n", address);
    }
    MEADOW_TRACE_INFORMATION("    DNS Servers:\n");
    FILE *dns_file = fopen(CONFIG_NETDB_RESOLVCONF_PATH, "rb");
    char buffer[32];
    while (fgets(buffer, 32, dns_file) != NULL)
    {
        MEADOW_TRACE_INFORMATION("        - %s", (buffer + 11));
    }
    fclose(dns_file);
    MEADOW_TRACE_INFORMATION("Internal Debug:\n");
    MEADOW_TRACE_INFORMATION("    Use UART for trace: %d\n", meadow_configuration->use_uart1_for_trace);
    MEADOW_TRACE_INFORMATION("    Trace level: %d\n", meadow_configuration->trace_level);
    MEADOW_TRACE_INFORMATION("    Debugger attached to ESP32: %d\n", (meadow_configuration->reset_esp32_at_startup == 1) ? 0 : 1);
#endif

    return(meadow_configuration);
}

/****************************************************************************
 * Name: hcom_nx_config_get_uint32_value
 *
 * Description:
 *  Get a uint32_t configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration value to be copied.
 *  destination - destination buffer to hold the value.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_uint32_value(int source, uint8_t *destination, int destination_length)
{
    if (destination_length < sizeof(uint32_t))
    {
        return(ERROR);
    }
    *((uint32_t *) destination) = source;
    return(sizeof(uint32_t));
}

/****************************************************************************
 * Name: hcom_nx_config_get_uint8_value
 *
 * Description:
 *  Get a uint8_t configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration value to be copied.
 *  destination - destination buffer to hold the value.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_uint8_value(uint8_t source, uint8_t *destination, int destination_length)
{
    int result = ERROR;

    if (destination_length > 0)
    {
        *destination = source;
        result = 1;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_string_value
 *
 * Description:
 *  Get a string configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration string to be copied.
 *  destination - destination buffer to hold the string.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_string_value(char *source, uint8_t *destination, int destination_length)
{
    int result = ERROR;
    
    if (source == NULL)
    {
        if ((destination != NULL) && (destination_length > 0))
        {
            *destination = 0;
            result = 0;
        }
    }
    else
    {
        if ((strlen(source) + 1) <= destination_length)
        {
            result = strlen(strcpy((char *) destination, source));
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_ip_address
 *
 * Description:
 *  Get an IP address or 0 if DHCP is enabled.
 *
 * Input Parameters:
 *  use_dhcp - use DHCP.
 *  ip_address - IP address to be used if DHCP is not enabled.
 *  destination - destination buffer to hold the string.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_ip_address(bool use_dhcp, uint32_t ip_address, uint8_t *destination, int destination_length)
{
    if (use_dhcp)
    {
        return(hcom_nx_config_get_uint32_value(0, destination, destination_length));
    }
    return(hcom_nx_config_get_uint32_value(ip_address, destination, destination_length));
}

/****************************************************************************
 * Name: hcom_nx_config_get_bytes
 *
 * Description:
 *  Get a byte array configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration bytes to be copied.
 *  source_length - length of the source buffer.
 *  destination - destination buffer to hold the string.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_bytes(uint8_t *source, int source_length, uint8_t *destination, int destination_length)
{
    int result;

    if (source_length > destination_length)
    {
        result = ERROR;
    }
    else
    {
        memcpy(destination, source, source_length);
        result = source_length;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_unique_id
 *
 * Description:
 *  get the unique ID from the config and format this into a string.
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *  buffer - Buffer to hold the unique ID string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  The config object is locked and released by the caller.
 *
 ****************************************************************************/
static int hcom_nx_config_get_unique_id(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result;

