WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    if (buffer_length > 0)
    {
        *buffer = config->default_interface->interface_type;
        result = 1;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_set_config_value
 *
 * Description:
 *  Read or write a configuration value.
 *
 * Input Parameters:
 *  item - Value to be accessed.
 *  direction - Read (0) or write (1).
 *  buffer - Buffer to hold the value when reading, or holding the new value
 *           when writing.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_get_set_config_value(int item, uint8_t direction, uint8_t *buffer, int buffer_length)
{
    int result;

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_config_get_pointer();
    if (direction == 0)
    {
        switch (item)
        {
            case cv_device_name:
                result = hcom_nx_config_get_string_value(config->device_name, buffer, buffer_length);
                break;
            case cv_reserved_pins:
                result = hcom_nx_config_get_string_value(config->reserved_pins, buffer, buffer_length);
                break;
            case cv_product:
                result = hcom_nx_config_get_uint32_value(config->hardware_version, buffer, buffer_length);
                break;
            case cv_model:
                result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_MODEL, buffer, buffer_length);
                break;
            case cv_os_version:
                result = hcom_nx_config_get_version_string(&config->os_version, buffer, buffer_length);
                break;
            case cv_mono_version:
                result = hcom_nx_config_get_version_string(&config->mono_version, buffer, buffer_length);
                break;
            case cv_build_date:
                result = hcom_nx_config_get_build_date(&config->os_version, buffer, buffer_length);
                break;
            case cv_processor_type:
                result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_PROCESSOR_TYPE, buffer, buffer_length);
                break;
            case cv_unique_id:
                result = hcom_nx_config_get_unique_id(config, buffer, buffer_length);
                break;
            case cv_serial_number:
                result = hcom_nx_config_get_serial_number(config, buffer, buffer_length);
                break;
            case cv_coprocessor_type:
                result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_COPROCESSOR_TYPE, buffer, buffer_length);
                break;
            case cv_coprocessor_firmware_version:
                result = hcom_nx_config_get_version_string(&config->esp_version, buffer, buffer_length);
                break;
            case cv_automatically_start_network:
                result = hcom_nx_config_get_uint8_value(config->automatically_start_network, buffer, buffer_length);
                break;
            case cv_automatically_reconnect:
                result = hcom_nx_config_get_uint8_value(config->automatically_reconnect, buffer, buffer_length);
                break;
            case cv_maximum_network_retry_count:
                result = hcom_nx_config_get_uint32_value(config->maximum_retry_count, buffer, buffer_length);
                break;
            case cv_get_time_at_startup:
                result = hcom_nx_config_get_uint8_value(config->get_network_time_at_startup, buffer, buffer_length);
                break;
            case cv_mac_address:
                result = hcom_nx_config_get_bytes(config->board_mac_address, sizeof(config->board_mac_address), buffer, buffer_length);
                break;
            case cv_soft_ap_mac_address:
                result = hcom_nx_config_get_bytes(config->soft_ap_mac_address, sizeof(config->soft_ap_mac_address), buffer, buffer_length);
                break;
            case cv_default_access_point:
                result = hcom_nx_config_get_string_value(config->default_access_point, buffer, buffer_length);
                break;
            case cv_reset_reason:
                result = hcom_nx_config_get_bytes(&config->esp32_reset_reason, 1, buffer, buffer_length);
                break;
            case cv_selected_network:
                result = hcom_nx_config_get_selected_network(config, buffer, buffer_length);
                break;
            case cv_static_ip_address:
                result = hcom_nx_config_get_ip_address(config->default_interface->use_dhcp == 1, config->default_interface->ip_address, buffer, buffer_length);
                break;
            case cv_default_gateway:
                result = hcom_nx_config_get_ip_address(config->default_interface->use_dhcp == 1, config->default_interface->gateway, buffer, buffer_length);
                break;
            case cv_subnet_mask:
                result = hcom_nx_config_get_ip_address(config->default_interface->use_dhcp == 1, config->default_interface->netmask, buffer, buffer_length);
                break;
            case cv_sd_storage_supported:
                result = hcom_nx_config_get_uint8_value(config->sd_storage_supported, buffer, buffer_length);
                break;
            default:
                result = ERROR;
                break;
        }
    }
    else
    {
        switch (item)
        {
            case cv_device_name:
                result = hcom_nx_config_set_device_name(config, buffer, buffer_length);
                break;
            case cv_automatically_reconnect:
                result = hcom_nx_config_set_automatically_reconnect(config, buffer, buffer_length);
                break;
            case cv_maximum_network_retry_count:
                result = hcom_nx_config_set_maximum_retry_count(config, buffer, buffer_length);
                break;
            default:
                result = ERROR;
                break;
        }
    }
    hcom_nx_config_unlock();
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_process_esp_configuration
 *
 * Description:
 *  Compare the incoming ESP configuration with the current configuration
 *  read from the configuration file.  The configuration file is considered
 *  to be the source of truth.
 *
 *  Send any differences over to the ESP32.
 *
 * Input Parameters:
 *  esp_config - Configuration stored in the ESP32.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_process_esp_configuration(espcp_system_configuration_t *esp_config)
{
    hcom_nx_config_lock();
    meadow_configuration_t *configuration = hcom_nx_config_get_pointer();
    if (configuration != NULL)
    {
        hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_reconnect, configuration->automatically_reconnect == 1);
        //
        if ((configuration->maximum_retry_count >= 3) && (configuration->maximum_retry_count != esp_config->maximum_retry_count))
        {
            hcom_nx_config_set_esp_integer_value(espcp_configuration_items_maximum_retry_count, configuration->maximum_retry_count);
        }
        //
        if ((esp_config->device_name != NULL) && (strcmp(configuration->device_name, esp_config->device_name) != 0))
        {
            hcom_nx_config_set_esp_string_value(espcp_configuration_items_device_name, configuration->device_name);
        }
        //
        if (esp_config->default_access_point != NULL)
        {
            configuration->default_access_point = kmm_strdup(esp_config->default_access_point);
        }
        else
        {
            configuration->default_access_point = NULL;
        }
        if ((!configuration->default_interface->use_dhcp) && (configuration->default_interface->interface_type == MEADOW_IFT_ESP32))
        {
            //
            //  Using the ESP32 and static IP address so let the ESP32 know about this.
            //
            hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_use_dhcp, configuration->default_interface->use_dhcp);
            hcom_nx_config_set_esp_integer_value(espcp_configuration_items_static_ip_address, configuration->default_interface->ip_address);
            hcom_nx_config_set_esp_integer_value(espcp_configuration_items_subnet_mask, configuration->default_interface->netmask);
            hcom_nx_config_set_esp_integer_value(espcp_configuration_items_default_gateway, configuration->default_interface->gateway);
        }
        //
        configuration->esp_version.major = esp_config->version_major;
        configuration->esp_version.minor = esp_config->version_minor;
        configuration->esp_version.revision = esp_config->version_revision;
        configuration->esp_version.build = esp_config->version_build;
        configuration->esp_version.day = esp_config->build_day;
        configuration->esp_version.month = esp_config->build_month;
        hcom_nx_config_set_month_text(&configuration->esp_version);
        configuration->esp_version.year = esp_config->build_year;
        configuration->esp_version.hour = esp_config->build_hour;
        configuration->esp_version.minute = esp_config->build_minute;
        configuration->esp_version.second = esp_config->build_second;
        configuration->esp_version.hash = esp_config->build_hash;
        kmm_free(configuration->esp_version.branch_name);
        configuration->esp_version.branch_name = kmm_strdup(esp_config->build_branch_name);
        kmm_free(configuration->esp_version.short_string);
        configuration->esp_version.short_string = hcom_nx_config_get_short_version_string(&configuration->esp_version);
        kmm_free(configuration->esp_version.long_string);
        configuration->esp_version.long_string = hcom_nx_config_get_long_version_string(&configuration->esp_version);
        //
        memcpy(configuration->board_mac_address, esp_config->board_mac_address, 6);
        memcpy(configuration->soft_ap_mac_address, esp_config->soft_ap_mac_address, 6);
        configuration->esp32_reset_reason = esp_config->reset_reason;
    }
    hcom_nx_config_unlock();
}

/****************************************************************************
 * Name: hcom_nx_config_process_wifi_credentials_file
 *
 * Description:
 *  Check to see if a wifi.yaml file exists and send the credentials to the
 *  ESP32 if it exists and contains valid data.
 *
 *  The wifi.yaml file will be deleted as a security measure to prevent
 *  the credentials from being downloaded using the CLI tool.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_process_wifi_credentials_file(void)
{
    yaml_wifi_credentials_t *credentials;

    cyaml_err_t err = cyaml_load_file(MEADOW_WIFI_CREDENTIALS_DEFAULT_FILE_NAME, &cyaml_config, &wifi_credentials_schema, (void **) &credentials, NULL);
    if ((err == CYAML_OK) && (credentials != NULL))
    {
        if ((credentials->credentials != NULL) && (credentials->credentials->ssid != NULL) && (strlen(credentials->credentials->ssid) <= MAXIMUM_SSID_LENGTH) & (strlen(credentials->credentials->ssid) > 0))
        {
            char password[MAXIMUM_PASSWORD_LENGTH + 1];
            memset(password, 0, MAXIMUM_PASSWORD_LENGTH + 1);
            if ((credentials->credentials->password != NULL) && (strlen(credentials->credentials->password) <= MAXIMUM_PASSWORD_LENGTH))
            {
                strcpy(password, credentials->credentials->password);
            }
            uint32_t size = strlen(credentials->credentials->ssid) + strlen(password) + 2;
            uint8_t *buffer = kmm_zalloc(size);
            if (buffer != NULL)
            {
                hcom_nx_config_lock();
                meadow_configuration_t *config = hcom_nx_config_get_pointer();
                kmm_free(config->default_access_point);
                config->default_access_point = kmm_strdup(credentials->credentials->ssid);
                hcom_nx_config_unlock();
                strcpy((char *) buffer, credentials->credentials->ssid);
                strcpy((char *) (buffer + strlen(credentials->credentials->ssid) + 1), password);
                hcom_nx_config_set_esp_value(espcp_configuration_items_default_ap_and_password, buffer, size);
                kmm_free(buffer);
            }
        }
        else
        {
            meadow_logging_write(mfl_error, "Invalid WiFi credentials file\n");
        }
        cyaml_free(&cyaml_config, &wifi_credentials_schema, credentials, 0);
    }
    else
    {
        meadow_logging_write(mfl_info, "WiFi credentials file not found\n");
    }
    //
    //  Now we can delete the file.
    //
    FILE *file = fopen(MEADOW_WIFI_CREDENTIALS_DEFAULT_FILE_NAME, "r");
    if (file)
    {
        fclose(file);
        unlink(MEADOW_WIFI_CREDENTIALS_DEFAULT_FILE_NAME);
    }
}

/****************************************************************************
 * Name: hcom_nx_config_get_cell_module_id
 *
 * Description:
 *  Get the cell module model id based on the module name set on the
 *  cell.settings.yaml.
 *
 * Input Parameters:
 *  None.
 * 
 * Returned Value:
 *  Correspondent module id for the cell module model defined
 *  by the user.
 * 
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_config_get_cell_module_id(void)
{
    uint32_t module_id;
    hcom_nx_config_lock();
    meadow_configuration_t *config;
    config = hcom_nx_config_get_pointer();

    if ((config != NULL) && (config->default_cell_settings != NULL))
    {
        module_id = config->default_cell_settings->module_id;
    }
    else
    {
        module_id = CELL_UNKNOWN_MODULE;
    }

    hcom_nx_config_unlock();
    syslog(LOG_INFO, "Cell module id: %u\n", module_id);

    return module_id;
}

/****************************************************************************
 * Name: hcom_nx_config_get_cell_turn_on_pin
 *
 * Description:
 *  Get the Meadow device pin used to turn on the cell module.
 *
 * Input Parameters:
 *  None.
 * 
 * Returned Value:
 *  Correspondent device pin for the turn-on pin defined
 *  by the user.
 * 
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_config_get_cell_turn_on_pin(void)
{
    uint32_t turn_on_pin = 0;
    hcom_nx_config_lock();
    meadow_configuration_t *config;
    config = hcom_nx_config_get_pointer();

    if ((config != NULL) && (config->default_cell_settings != NULL))
    {
        turn_on_pin = config->default_cell_settings->turn_on_pin;
    }

    hcom_nx_config_unlock();
    syslog(LOG_INFO, "Cell turn-on pin: %u\n", turn_on_pin);

