WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    return turn_on_pin;
}

/****************************************************************************
 * Name: hcom_nx_config_process_cell_config_file
 *
 * Description:
 *  Check to see if a cell.config.yaml file exists and use the settings
 *  if it exists and contains valid data.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 * 
 ****************************************************************************/
void hcom_nx_config_process_cell_config_file(void)
{
    yaml_cell_config_t *settings;
    cyaml_err_t err = cyaml_load_file(MEADOW_CELL_CONFIG_DEFAULT_FILE_NAME, &cyaml_config, &cell_settings_schema, (void **) &settings, NULL);
    syslog(LOG_INFO, "Cell config file load status: %d\n", err);
    if ((err == CYAML_OK) && (settings != NULL))
    {
        syslog(LOG_INFO, "Cell settings found\n");

        hcom_nx_config_lock();
        meadow_configuration_t *config = hcom_nx_config_get_pointer();

        config->default_cell_settings = (cell_settings_t*) malloc(sizeof(cell_settings_t));

        if ((config->default_cell_settings != NULL) &&
            (settings->settings->apn != NULL) &&
            (strlen(settings->settings->apn) <= MAXIMUM_APN_LENGTH) &&
            (strlen(settings->settings->apn) > 0))
        {
            config->default_cell_settings->apn = kmm_strdup(settings->settings->apn);
            syslog(LOG_INFO, "Default cell APN loaded: %s\n", config->default_cell_settings->apn);

            config->default_cell_settings->timeout = ((settings->settings->timeout != NULL) &&
                                                    (strlen(settings->settings->timeout) <= MAXIMUM_TIMEOUT_LENGTH) &&
                                                    (strlen(settings->settings->timeout) > 0)) ?
                                                    kmm_strdup(settings->settings->timeout) :
                                                    kmm_strdup(DEFAULT_CELL_PPPD_TIMEOUT);

            syslog(LOG_INFO, "Default cell PPPD timeout loaded: %s\n", config->default_cell_settings->timeout);

            config->default_cell_settings->pap_user = ((settings->settings->user != NULL) &&
                                                        (strlen(settings->settings->user) <= MAXIMUM_USER_LENGTH) &&
                                                        (strlen(settings->settings->user) > 0)) ?
                                                        kmm_strdup(settings->settings->user) :
                                                        kmm_strdup(DEFAULT_CELL_PAP_USER);

            syslog(LOG_INFO, "Default cell PAP username loaded: %s\n", config->default_cell_settings->pap_user);

            config->default_cell_settings->pap_password = ((settings->settings->password != NULL) &&
                                                            (strlen(settings->settings->password) <= MAXIMUM_PASSWORD_LENGTH) &&
                                                            (strlen(settings->settings->password) > 0)) ?
                                                            kmm_strdup(settings->settings->password) :
                                                            kmm_strdup(DEFAULT_CELL_PAP_PASSWORD);

            syslog(LOG_INFO, "Default cell PAP password loaded: %s\n", config->default_cell_settings->pap_password);

            config->default_cell_settings->ttyname = ((settings->settings->ttyname != NULL) &&
                                                        (strlen(settings->settings->ttyname) <= MAXIMUM_INTERFACE_LENGTH) &&
                                                        (strlen(settings->settings->ttyname) > 0)) ?
                                                        kmm_strdup(settings->settings->ttyname) :
                                                        kmm_strdup(DEFAULT_CELL_INTERFACE);

            syslog(LOG_INFO, "Default cell interface name loaded: %s\n", config->default_cell_settings->ttyname);

            config->default_cell_settings->turn_on_pin_name = ((settings->settings->turn_on_pin_name != NULL) &&
                                                        (strlen(settings->settings->turn_on_pin_name) <= MAXIMUM_TURN_ON_PIN_LENGTH) &&
                                                        (strlen(settings->settings->turn_on_pin_name) > 0)) ? 
                                                        kmm_strdup(settings->settings->turn_on_pin_name) :
                                                        kmm_strdup(DEFAULT_CELL_TURN_ON_PIN);

            syslog(LOG_INFO, "Default cell turn-on pin name loaded: %s\n", config->default_cell_settings->turn_on_pin_name);

            config->default_cell_settings->mode = ((settings->settings->mode != NULL) &&
                                                    (strlen(settings->settings->mode) <= MAXIMUM_MODE_LENTGH) &&
                                                    (strlen(settings->settings->mode) > 0)) ?
                                                    kmm_strdup(settings->settings->mode) :
                                                    kmm_strdup(DEFAULT_CELL_MODE);

            syslog(LOG_INFO, "Default cell operation mode loaded: %s\n", config->default_cell_settings->mode);

            config->default_cell_settings->operator = ((settings->settings->operator != NULL) &&
                                                        (strlen(settings->settings->operator) <= MAXIMUM_OPERATOR_LENGTH) &&
                                                        (strlen(settings->settings->operator) > 0)) ?
                                                        kmm_strdup(settings->settings->operator) :
                                                        kmm_strdup(DEFAULT_CELL_OPERATOR);

            syslog(LOG_INFO, "Default cell operator loaded: %s\n", config->default_cell_settings->operator);

            config->default_cell_settings->module = ((settings->settings->module != NULL) &&
                                                        (strlen(settings->settings->module) <= MAXIMUM_MODULE_LENGTH) &&
                                                        (strlen(settings->settings->module) > 0)) ?
                                                        kmm_strdup(settings->settings->module) :
                                                        kmm_strdup(CELL_UNKNOWN_MODULE_NAME);

