WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
            syslog(LOG_INFO, "Default cell module loaded: %s\n", config->default_cell_settings->module);

            config->default_cell_settings->scan_mode = hcom_nx_config_parse_boolean(settings->settings->scan_mode, 0);

            syslog(LOG_INFO, "Default cell scan mode: %u\n", config->default_cell_settings->scan_mode);

            hcom_nx_config_populate_cell_module_id(config);

            syslog(LOG_INFO, "Default cell module id populated: %u\n", config->default_cell_settings->module_id);

            hcom_nx_config_populate_cell_network_mode_id(config);

            syslog(LOG_INFO, "Default cell network mode id populated: %u\n", config->default_cell_settings->mode_id);

            hcom_nx_config_map_cell_network_mode(config);

            syslog(LOG_INFO, "Default cell operation mode updated after mapping: %s\n", config->default_cell_settings->mode);

            hcom_nx_config_map_cell_turn_on_pin(config);

            syslog(LOG_INFO, "Default cell turn-on pin mapped: %u\n", config->default_cell_settings->turn_on_pin);
        }
        else
        {
            if (config->default_cell_settings != NULL) 
            {
                free(config->default_cell_settings);
                config->default_cell_settings = NULL;
            }
            syslog(LOG_ERR, "Failed to get default cell settings\n");
        }

        hcom_nx_config_unlock();
        cyaml_free(&cyaml_config, &cell_settings_schema, settings, 0);
        syslog(LOG_INFO, "Cyaml free\n");
    }

}

/****************************************************************************
 * Name: hcom_nx_config_set_time_to_os_build_time
 *
 * Description:
 *  Use the OS build time as the minimum initial value for the system clock.
 * 
 *  SSL certificate validation requires the clock to be set to a recent time.
 *  The board must be operating after the OS build time so using this gives
 *  the board a starting point.  A more accurate clock can be set later
 *  using NTP.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
void hcom_nx_config_set_time_to_os_build_time(void)
{
    struct timespec tp;
    clock_gettime(CLOCK_REALTIME, &tp);
    if (tp.tv_sec < HCOM_DEVICE_INFO_BUILD_EPOCH_TIME)
    {
        tp.tv_sec = HCOM_DEVICE_INFO_BUILD_EPOCH_TIME;
        tp.tv_nsec = 0;
        clock_settime(CLOCK_REALTIME, &tp);
    }
}

/****************************************************************************
 * Name: hcom_nx_config_turn_on_the_cell_module
 *
 * Description:
 *  Function to turn on the cell module, which can vary according to
 *  the meadow device pinout and modem model used.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
void hcom_nx_config_turn_on_the_cell_module()
{
    uint32_t module_id; 
    uint32_t turn_on_pin;
    module_id = hcom_nx_config_get_cell_module_id();
    turn_on_pin = hcom_nx_config_get_cell_turn_on_pin();

    if (turn_on_pin > 0)
    {
        switch (module_id)
        {
            case CELL_BG770A_MODULE:
                // Low pulse for 3 seconds to turn on the Quectel BG770A-GL cell module
                syslog(LOG_INFO, "Turning on BG770A module\n");
                stm32_configgpio(GPIO_OUTPUT | GPIO_FLOAT | GPIO_OPENDRAIN | turn_on_pin); 
                stm32_gpiowrite(turn_on_pin, false);
                usleep(3000000);
                stm32_gpiowrite(turn_on_pin, true);
                stm32_gpiowrite(turn_on_pin, false);
            break;

            case CELL_M95_MODULE:
                syslog(LOG_INFO, "Turning on M95 module\n");
                stm32_configgpio(GPIO_OUTPUT | turn_on_pin);
                stm32_gpiowrite(turn_on_pin, true);
            break;

            case CELL_BG95M3_MODULE:
                syslog(LOG_INFO, "Turning on BG95-M3 module\n");
                stm32_configgpio(GPIO_OUTPUT | turn_on_pin);
                stm32_gpiowrite(turn_on_pin, true);
                usleep(3000000);
                stm32_gpiowrite(turn_on_pin, false);
            break;

            case CELL_EG21GL_MODULE:
                // Low pulse for 500 milliseconds to turn on the Quectel EG21-GL cell module
                syslog(LOG_INFO, "Turning on EG21-GL module\n");
                stm32_configgpio(GPIO_OUTPUT | GPIO_FLOAT | GPIO_OPENDRAIN | turn_on_pin); 
                stm32_gpiowrite(turn_on_pin, false);
                usleep(500000);
                stm32_gpiowrite(turn_on_pin, true);
            break;

            default:
                syslog(LOG_INFO, "Failed to identify and turn on the cell module\n");
            break;
        }
    }
    else
    {
        syslog(LOG_INFO, "Failed to turn on the cell module\n");
    }

    // TODO: Add support to turn on the BG770A-GL on the Project Lab and for
    // Meadow F7v1 Feather
}

/****************************************************************************
 * Name: hcom_nx_config_refresh_mono_version
 *
 * Description:
 *  Refresh the mono version in the specified configuration object.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration object must be locked before this method is called.
 *
 ****************************************************************************/
void hcom_nx_config_refresh_mono_version(meadow_configuration_t *config)
{
    uint32_t block_size = hcom_nx_exec_ex_flash_get_block_size();

    mono_signature_t *mono_signature = (mono_signature_t *) kmm_zalloc(block_size);
    if (mono_signature != NULL)
    {
        hcom_nx_exec_ex_flash_read_absolute_block(0, (void *) mono_signature);
        memset(&config->mono_version, 0, sizeof(meadow_version_number_t));
        if (mono_signature->signature != 0xDDCCBBAA)
        {
            syslog(LOG_ERR, "Mono runtime was not found flashed in external flash.\n");
        }
        else
        {
            if ((mono_signature->build & 0x00ffff00) != 0)
            {
                //
                //  For older versions of Meadow.OS.Runtime.bin the version number
                //  was encoded as a single uint32_t.
                //
                //  TODO: Change this after version 1.0 and before version 256.0.
                //
                config->mono_version.revision = (mono_signature->build >> 8) & 0xff;
                config->mono_version.minor = (mono_signature->build >> 16) & 0xff;
                config->mono_version.major = (mono_signature->build  >> 24) & 0xff;
                config->mono_version.build = mono_signature->build & 0xff;
            }
            else
            {
                config->mono_version.build = mono_signature->build;
                config->mono_version.revision = mono_signature->revision;
                config->mono_version.minor = mono_signature->minor;
                config->mono_version.major = mono_signature->major;
                config->mono_version.day = mono_signature->day;
                config->mono_version.month = mono_signature->month;
                hcom_nx_config_set_month_text(&config->mono_version);
                config->mono_version.year = mono_signature->year;
                config->mono_version.hour = mono_signature->hour;
                config->mono_version.minute = mono_signature->minute;
                config->mono_version.second = mono_signature->second;
                config->mono_version.hash = mono_signature->hash;
                config->mono_version.branch_name = kmm_strdup((char *) &mono_signature->start_of_branch_string);
                config->mono_version.short_string = hcom_nx_config_get_short_version_string(&config->mono_version);
                config->mono_version.long_string = hcom_nx_config_get_long_version_string(&config->mono_version);
            }
        }
        kmm_free(mono_signature);
    }
}

/****************************************************************************
 * Name: hcom_nx_config_init
 *
 * Description:
 *  Setup the configuration system and populate the configuration structure
 *  with data from the configuration file.
 * 
 *  Note that one of the side effects of this method is to copy the Mono
 *  runtime into RAM making it ready for use (assuming the runtime file is 
 *  validated OK).
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_init(void)
{
    if (meadow_configuration == NULL)
    {
        sem_init(&config_lock, 0, 1);                   // Create the config lock.
        sem_setprotocol(&config_lock, SEM_PRIO_NONE);
        hcom_nx_config_process_meadow_config_file();

        hcom_nx_config_lock();
        meadow_configuration_t *config = hcom_nx_config_get_pointer();
        hcom_nx_config_set_host_name(config, config->device_name);
        config->hardware_version = meadow_hw_version_get();
        hcom_nx_config_refresh_mono_version(config);
        config->os_version.major = HCOM_DEVICE_INFO_MAJOR;
        config->os_version.minor = HCOM_DEVICE_INFO_MINOR;
        config->os_version.revision = HCOM_DEVICE_INFO_REVISION;
        config->os_version.build = HCOM_DEVICE_INFO_BUILD;
        config->os_version.day = HCOM_DEVICE_INFO_BUILD_DAY;
        config->os_version.month = HCOM_DEVICE_INFO_BUILD_MONTH;
        hcom_nx_config_set_month_text(&config->os_version);
        config->os_version.year = HCOM_DEVICE_INFO_BUILD_YEAR;
        config->os_version.hour = HCOM_DEVICE_INFO_BUILD_HOUR;
        config->os_version.minute = HCOM_DEVICE_INFO_BUILD_MINUTE;
        config->os_version.second = HCOM_DEVICE_INFO_BUILD_SECOND;
        config->os_version.hash = HCOM_DEVICE_INFO_BUILD_HASH_NUMBER;
        config->os_version.branch_name = HCOM_DEVICE_INFO_GIT_REF;
        config->os_version.short_string = hcom_nx_config_get_short_version_string(&config->os_version);
        config->os_version.long_string = hcom_nx_config_get_long_version_string(&config->os_version);
        config->hardware_version_text = meadow_hw_version_string_return();
        stm32_get_uniqueid(config->serial_number);                           // Convert chip Id to serial number
        config->chip_id[0] = config->serial_number[11];                      // 95-88
        config->chip_id[1] = config->serial_number[10] + config->serial_number[2];        // 87-80 + 23-16
        config->chip_id[2] = config->serial_number[9];                       // 79-72
        config->chip_id[3] = config->serial_number[8] + config->serial_number[0] + 10;    // 71-64 + 7-0 + magic 10
        config->chip_id[4] = config->serial_number[7];                       // 63-56
        config->chip_id[5] = config->serial_number[6];                       // 55-48

        hcom_nx_config_unlock();
    }
    else
    {
        syslog(LOG_ERR, "Configuration should only be initialised once.\n");
    }
}
